Duet3D/Duet3Expansion/src/atmel/SAME70_DFP/2.3.98/same70a/atdf/ATSAME70J21.atdf
      <value-group caption="" name="MCAN_FBTP__TDC">
        <value caption="Transceiver Delay Compensation disabled." name="DISABLED" value="0"/>
        <value caption="Transceiver Delay Compensation enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="" name="MCAN_TEST__LBCK">
        <value caption="Reset value. Loop Back mode is disabled." name="DISABLED" value="0"/>
        <value caption="Loop Back mode is enabled (see Section 1.5.1.9)." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="" name="MCAN_TEST__TX">
        <value caption="Reset value, CANTX controlled by the CAN Core, updated at the end of the CAN bit time." name="RESET" value="0x0"/>
        <value caption="Sample Point can be monitored at pin CANTX." name="SAMPLE_POINT_MONITORING" value="0x1"/>
        <value caption="Dominant ('0') level at pin CANTX." name="DOMINANT" value="0x2"/>
        <value caption="Recessive ('1') at pin CANTX." name="RECESSIVE" value="0x3"/>
      </value-group>
      <value-group caption="" name="MCAN_CCCR__INIT">
        <value caption="Normal operation." name="DISABLED" value="0"/>
        <value caption="Initialization is started." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="" name="MCAN_CCCR__CCE">
        <value caption="The processor has no write access to the protected configuration registers." name="PROTECTED" value="0"/>
        <value caption="The processor has write access to the protected configuration registers (while MCAN_CCCR.INIT = '1')." name="CONFIGURABLE" value="1"/>
      </value-group>
      <value-group caption="" name="MCAN_CCCR__ASM">
        <value caption="Normal CAN operation." name="NORMAL" value="0"/>
        <value caption="Restricted operation mode active." name="RESTRICTED" value="1"/>
      </value-group>
      <value-group caption="" name="MCAN_CCCR__CSR">
        <value caption="No clock stop is requested." name="NO_CLOCK_STOP" value="0"/>
        <value caption="Clock stop requested. When clock stop is requested, first INIT and then CSA will be set after all pend-ing transfer requests have been completed and the CAN bus reached idle." name="CLOCK_STOP" value="1"/>
      </value-group>
      <value-group caption="" name="MCAN_CCCR__MON">
        <value caption="Bus Monitoring mode is disabled." name="DISABLED" value="0"/>
        <value caption="Bus Monitoring mode is enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="" name="MCAN_CCCR__DAR">
        <value caption="Automatic retransmission of messages not transmitted successfully enabled." name="AUTO_RETX" value="0"/>
        <value caption="Automatic retransmission disabled." name="NO_AUTO_RETX" value="1"/>
      </value-group>
      <value-group caption="" name="MCAN_CCCR__TEST">
        <value caption="Normal operation, MCAN_TEST register holds reset values." name="DISABLED" value="0"/>
        <value caption="Test mode, write access to MCAN_TEST register enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="" name="MCAN_CCCR__CME">
        <value caption="CAN operation according to ISO11898-1 enabled" name="ISO11898_1" value="0"/>
        <value caption="CAN FD operation enabled" name="FD" value="1"/>
      </value-group>
      <value-group caption="" name="MCAN_CCCR__CMR">
        <value caption="No mode change" name="NO_CHANGE" value="0x0"/>
        <value caption="Request CAN FD operation" name="FD" value="0x1"/>
        <value caption="Request CAN FD operation with bit rate switching" name="FD_BITRATE_SWITCH" value="0x2"/>
        <value caption="Request CAN operation according ISO11898-1" name="ISO11898_1" value="0x3"/>
      </value-group>
      <value-group caption="" name="MCAN_TSCC__TSS">
        <value caption="Timestamp counter value always 0x0000" name="ALWAYS_0" value="0x0"/>
        <value caption="Timestamp counter value incremented according to TCP" name="TCP_INC" value="0x1"/>
        <value caption="External timestamp counter value used" name="EXT_TIMESTAMP" value="0x2"/>
      </value-group>
      <value-group caption="" name="MCAN_TOCC__ETOC">
        <value caption="Timeout Counter disabled." name="NO_TIMEOUT" value="0"/>
        <value caption="Timeout Counter enabled." name="TOS_CONTROLLED" value="1"/>
      </value-group>
      <value-group caption="" name="MCAN_TOCC__TOS">
        <value caption="Continuous operation" name="CONTINUOUS" value="0x0"/>
        <value caption="Timeout controlled by Tx Event FIFO" name="TX_EV_TIMEOUT" value="0x1"/>
        <value caption="Timeout controlled by Receive FIFO 0" name="RX0_EV_TIMEOUT" value="0x2"/>
        <value caption="Timeout controlled by Receive FIFO 1" name="RX1_EV_TIMEOUT" value="0x3"/>
      </value-group>
      <value-group caption="" name="MCAN_PSR__LEC">
        <value caption="No error occurred since LEC has been reset by successful reception or transmission." name="NO_ERROR" value="0x0"/>
        <value caption="More than 5 equal bits in a sequence have occurred in a part of a received message where this is not allowed." name="STUFF_ERROR" value="0x1"/>
        <value caption="A fixed format part of a received frame has the wrong format." name="FORM_ERROR" value="0x2"/>
        <value caption="The message transmitted by the MCAN was not acknowledged by another node." name="ACK_ERROR" value="0x3"/>
        <value caption="During the transmission of a message (with the exception of the arbitration field), the device wanted to send a recessive level (bit of logical value '1'), but the monitored bus value was dominant." name="BIT1_ERROR" value="0x4"/>
        <value caption="During the transmission of a message (or acknowledge bit, or active error flag, or overload flag), the device wanted to send a dominant level (data or identifier bit logical value '0'), but the monitored bus value was recessive. During Bus_Off recovery this status is set each time a sequence of 11 recessive bits has been monitored. This enables the processor to monitor the proceeding of the Bus_Off recovery sequence (indicating the bus is not stuck at dominant or continuously disturbed)." name="BIT0_ERROR" value="0x5"/>
        <value caption="The CRC check sum of a received message was incorrect. The CRC of an incoming message does not match with the CRC calculated from the received data." name="CRC_ERROR" value="0x6"/>
        <value caption="Any read access to the Protocol Status Register re-initializes the LEC to '7'. When the LEC shows the value '7', no CAN bus event was detected since the last processor read access to the Protocol Status Register." name="NO_CHANGE" value="0x7"/>
      </value-group>
      <value-group caption="" name="MCAN_PSR__ACT">
        <value caption="Node is synchronizing on CAN communication" name="SYNCHRONIZING" value="0x0"/>
        <value caption="Node is neither receiver nor transmitter" name="IDLE" value="0x1"/>
        <value caption="Node is operating as receiver" name="RECEIVER" value="0x2"/>
        <value caption="Node is operating as transmitter" name="TRANSMITTER" value="0x3"/>
      </value-group>
      <value-group caption="" name="MCAN_GFC__RRFE">
        <value caption="Filter remote frames with 29-bit extended IDs." name="FILTER" value="0"/>
        <value caption="Reject all remote frames with 29-bit extended IDs." name="REJECT" value="1"/>
      </value-group>
      <value-group caption="" name="MCAN_GFC__RRFS">
        <value caption="Filter remote frames with 11-bit standard IDs." name="FILTER" value="0"/>
        <value caption="Reject all remote frames with 11-bit standard IDs." name="REJECT" value="1"/>
      </value-group>
      <value-group caption="" name="MCAN_GFC__ANFE">
        <value caption="Message stored in Receive FIFO 0" name="RX_FIFO_0" value="0"/>
        <value caption="Message stored in Receive FIFO 1" name="RX_FIFO_1" value="1"/>
      </value-group>
      <value-group caption="" name="MCAN_GFC__ANFS">
        <value caption="Message stored in Receive FIFO 0" name="RX_FIFO_0" value="0"/>
        <value caption="Message stored in Receive FIFO 1" name="RX_FIFO_1" value="1"/>
      </value-group>
      <value-group caption="" name="MCAN_HPMS__MSI">
        <value caption="No FIFO selected." name="NO_FIFO_SEL" value="0x0"/>
        <value caption="FIFO message." name="LOST" value="0x1"/>
        <value caption="Message stored in FIFO 0." name="FIFO_0" value="0x2"/>
        <value caption="Message stored in FIFO 1." name="FIFO_1" value="0x3"/>
      </value-group>
      <value-group caption="" name="MCAN_RXF1S__DMS">
        <value caption="Idle state, wait for reception of debug messages, DMA request is cleared." name="IDLE" value="0x0"/>
        <value caption="Debug message A received." name="MSG_A" value="0x1"/>
        <value caption="Debug messages A, B received." name="MSG_AB" value="0x2"/>
        <value caption="Debug messages A, B, C received, DMA request is set." name="MSG_ABC" value="0x3"/>
      </value-group>
      <value-group caption="" name="MCAN_RXESC__F0DS">
        <value caption="8-byte data field" name="_8_BYTE" value="0x0"/>
        <value caption="12-byte data field" name="_12_BYTE" value="0x1"/>
        <value caption="16-byte data field" name="_16_BYTE" value="0x2"/>
        <value caption="20-byte data field" name="_20_BYTE" value="0x3"/>
        <value caption="24-byte data field" name="_24_BYTE" value="0x4"/>
        <value caption="32-byte data field" name="_32_BYTE" value="0x5"/>
        <value caption="48-byte data field" name="_48_BYTE" value="0x6"/>
        <value caption="64-byte data field" name="_64_BYTE" value="0x7"/>
      </value-group>
      <value-group caption="" name="MCAN_RXESC__F1DS">
        <value caption="8-byte data field" name="_8_BYTE" value="0x0"/>
        <value caption="12-byte data field" name="_12_BYTE" value="0x1"/>
        <value caption="16-byte data field" name="_16_BYTE" value="0x2"/>
        <value caption="20-byte data field" name="_20_BYTE" value="0x3"/>
        <value caption="24-byte data field" name="_24_BYTE" value="0x4"/>
        <value caption="32-byte data field" name="_32_BYTE" value="0x5"/>
        <value caption="48-byte data field" name="_48_BYTE" value="0x6"/>
        <value caption="64-byte data field" name="_64_BYTE" value="0x7"/>
      </value-group>
      <value-group caption="" name="MCAN_RXESC__RBDS">
        <value caption="8-byte data field" name="_8_BYTE" value="0x0"/>
        <value caption="12-byte data field" name="_12_BYTE" value="0x1"/>
        <value caption="16-byte data field" name="_16_BYTE" value="0x2"/>
        <value caption="20-byte data field" name="_20_BYTE" value="0x3"/>
        <value caption="24-byte data field" name="_24_BYTE" value="0x4"/>
        <value caption="32-byte data field" name="_32_BYTE" value="0x5"/>
        <value caption="48-byte data field" name="_48_BYTE" value="0x6"/>
        <value caption="64-byte data field" name="_64_BYTE" value="0x7"/>
      </value-group>
      <value-group caption="" name="MCAN_TXESC__TBDS">
        <value caption="8-byte data field" name="_8_BYTE" value="0x0"/>
        <value caption="12-byte data field" name="_12_BYTE" value="0x1"/>
        <value caption="16-byte data field" name="_16_BYTE" value="0x2"/>
        <value caption="20-byte data field" name="_20_BYTE" value="0x3"/>
        <value caption="24-byte data field" name="_24_BYTE" value="0x4"/>
        <value caption="32-byte data field" name="_32_BYTE" value="0x5"/>
        <value caption="48- byte data field" name="_48_BYTE" value="0x6"/>
        <value caption="64-byte data field" name="_64_BYTE" value="0x7"/>
      </value-group>
    </module>
    <module name="PIO" caption="Parallel Input/Output Controller" id="11004" version="U">
      <register-group name="PIO">
        <register caption="PIO Enable Register" name="PIO_PER" offset="0x0000" rw="W" size="4" atomic-op="set:PIO_PSR">
          <bitfield caption="PIO Enable" mask="0x00000001" name="P0"/>
          <bitfield caption="PIO Enable" mask="0x00000002" name="P1"/>
          <bitfield caption="PIO Enable" mask="0x00000004" name="P2"/>
          <bitfield caption="PIO Enable" mask="0x00000008" name="P3"/>
          <bitfield caption="PIO Enable" mask="0x00000010" name="P4"/>
          <bitfield caption="PIO Enable" mask="0x00000020" name="P5"/>
          <bitfield caption="PIO Enable" mask="0x00000040" name="P6"/>
          <bitfield caption="PIO Enable" mask="0x00000080" name="P7"/>
          <bitfield caption="PIO Enable" mask="0x00000100" name="P8"/>
          <bitfield caption="PIO Enable" mask="0x00000200" name="P9"/>
          <bitfield caption="PIO Enable" mask="0x00000400" name="P10"/>
          <bitfield caption="PIO Enable" mask="0x00000800" name="P11"/>
          <bitfield caption="PIO Enable" mask="0x00001000" name="P12"/>
          <bitfield caption="PIO Enable" mask="0x00002000" name="P13"/>
          <bitfield caption="PIO Enable" mask="0x00004000" name="P14"/>
          <bitfield caption="PIO Enable" mask="0x00008000" name="P15"/>
          <bitfield caption="PIO Enable" mask="0x00010000" name="P16"/>
          <bitfield caption="PIO Enable" mask="0x00020000" name="P17"/>
          <bitfield caption="PIO Enable" mask="0x00040000" name="P18"/>
          <bitfield caption="PIO Enable" mask="0x00080000" name="P19"/>
          <bitfield caption="PIO Enable" mask="0x00100000" name="P20"/>
          <bitfield caption="PIO Enable" mask="0x00200000" name="P21"/>
          <bitfield caption="PIO Enable" mask="0x00400000" name="P22"/>
          <bitfield caption="PIO Enable" mask="0x00800000" name="P23"/>
          <bitfield caption="PIO Enable" mask="0x01000000" name="P24"/>
          <bitfield caption="PIO Enable" mask="0x02000000" name="P25"/>
          <bitfield caption="PIO Enable" mask="0x04000000" name="P26"/>
          <bitfield caption="PIO Enable" mask="0x08000000" name="P27"/>
          <bitfield caption="PIO Enable" mask="0x10000000" name="P28"/>
          <bitfield caption="PIO Enable" mask="0x20000000" name="P29"/>
          <bitfield caption="PIO Enable" mask="0x40000000" name="P30"/>
          <bitfield caption="PIO Enable" mask="0x80000000" name="P31"/>
        </register>
        <register caption="PIO Disable Register" name="PIO_PDR" offset="0x0004" rw="W" size="4" atomic-op="clear:PIO_PSR">
          <bitfield caption="PIO Disable" mask="0x00000001" name="P0"/>
          <bitfield caption="PIO Disable" mask="0x00000002" name="P1"/>
          <bitfield caption="PIO Disable" mask="0x00000004" name="P2"/>
          <bitfield caption="PIO Disable" mask="0x00000008" name="P3"/>
          <bitfield caption="PIO Disable" mask="0x00000010" name="P4"/>
          <bitfield caption="PIO Disable" mask="0x00000020" name="P5"/>
          <bitfield caption="PIO Disable" mask="0x00000040" name="P6"/>
          <bitfield caption="PIO Disable" mask="0x00000080" name="P7"/>
          <bitfield caption="PIO Disable" mask="0x00000100" name="P8"/>
          <bitfield caption="PIO Disable" mask="0x00000200" name="P9"/>
          <bitfield caption="PIO Disable" mask="0x00000400" name="P10"/>
          <bitfield caption="PIO Disable" mask="0x00000800" name="P11"/>
          <bitfield caption="PIO Disable" mask="0x00001000" name="P12"/>
          <bitfield caption="PIO Disable" mask="0x00002000" name="P13"/>
          <bitfield caption="PIO Disable" mask="0x00004000" name="P14"/>
          <bitfield caption="PIO Disable" mask="0x00008000" name="P15"/>
          <bitfield caption="PIO Disable" mask="0x00010000" name="P16"/>
          <bitfield caption="PIO Disable" mask="0x00020000" name="P17"/>
          <bitfield caption="PIO Disable" mask="0x00040000" name="P18"/>
          <bitfield caption="PIO Disable" mask="0x00080000" name="P19"/>
          <bitfield caption="PIO Disable" mask="0x00100000" name="P20"/>
          <bitfield caption="PIO Disable" mask="0x00200000" name="P21"/>
          <bitfield caption="PIO Disable" mask="0x00400000" name="P22"/>
          <bitfield caption="PIO Disable" mask="0x00800000" name="P23"/>
          <bitfield caption="PIO Disable" mask="0x01000000" name="P24"/>
          <bitfield caption="PIO Disable" mask="0x02000000" name="P25"/>
          <bitfield caption="PIO Disable" mask="0x04000000" name="P26"/>
          <bitfield caption="PIO Disable" mask="0x08000000" name="P27"/>
          <bitfield caption="PIO Disable" mask="0x10000000" name="P28"/>
          <bitfield caption="PIO Disable" mask="0x20000000" name="P29"/>
          <bitfield caption="PIO Disable" mask="0x40000000" name="P30"/>
          <bitfield caption="PIO Disable" mask="0x80000000" name="P31"/>
        </register>
        <register caption="PIO Status Register" name="PIO_PSR" offset="0x0008" rw="R" size="4">
          <bitfield caption="PIO Status" mask="0x00000001" name="P0"/>
          <bitfield caption="PIO Status" mask="0x00000002" name="P1"/>
          <bitfield caption="PIO Status" mask="0x00000004" name="P2"/>
          <bitfield caption="PIO Status" mask="0x00000008" name="P3"/>
          <bitfield caption="PIO Status" mask="0x00000010" name="P4"/>
          <bitfield caption="PIO Status" mask="0x00000020" name="P5"/>
          <bitfield caption="PIO Status" mask="0x00000040" name="P6"/>
          <bitfield caption="PIO Status" mask="0x00000080" name="P7"/>
          <bitfield caption="PIO Status" mask="0x00000100" name="P8"/>
          <bitfield caption="PIO Status" mask="0x00000200" name="P9"/>
          <bitfield caption="PIO Status" mask="0x00000400" name="P10"/>
          <bitfield caption="PIO Status" mask="0x00000800" name="P11"/>
          <bitfield caption="PIO Status" mask="0x00001000" name="P12"/>
          <bitfield caption="PIO Status" mask="0x00002000" name="P13"/>
          <bitfield caption="PIO Status" mask="0x00004000" name="P14"/>
          <bitfield caption="PIO Status" mask="0x00008000" name="P15"/>
          <bitfield caption="PIO Status" mask="0x00010000" name="P16"/>
          <bitfield caption="PIO Status" mask="0x00020000" name="P17"/>
          <bitfield caption="PIO Status" mask="0x00040000" name="P18"/>
          <bitfield caption="PIO Status" mask="0x00080000" name="P19"/>
          <bitfield caption="PIO Status" mask="0x00100000" name="P20"/>
          <bitfield caption="PIO Status" mask="0x00200000" name="P21"/>
          <bitfield caption="PIO Status" mask="0x00400000" name="P22"/>
          <bitfield caption="PIO Status" mask="0x00800000" name="P23"/>
          <bitfield caption="PIO Status" mask="0x01000000" name="P24"/>
          <bitfield caption="PIO Status" mask="0x02000000" name="P25"/>
          <bitfield caption="PIO Status" mask="0x04000000" name="P26"/>
          <bitfield caption="PIO Status" mask="0x08000000" name="P27"/>
          <bitfield caption="PIO Status" mask="0x10000000" name="P28"/>
          <bitfield caption="PIO Status" mask="0x20000000" name="P29"/>
          <bitfield caption="PIO Status" mask="0x40000000" name="P30"/>
          <bitfield caption="PIO Status" mask="0x80000000" name="P31"/>
        </register>
        <register caption="Output Enable Register" name="PIO_OER" offset="0x0010" rw="W" size="4" atomic-op="set:PIO_OSR">
          <bitfield caption="Output Enable" mask="0x00000001" name="P0"/>
          <bitfield caption="Output Enable" mask="0x00000002" name="P1"/>
          <bitfield caption="Output Enable" mask="0x00000004" name="P2"/>
          <bitfield caption="Output Enable" mask="0x00000008" name="P3"/>
          <bitfield caption="Output Enable" mask="0x00000010" name="P4"/>
          <bitfield caption="Output Enable" mask="0x00000020" name="P5"/>
          <bitfield caption="Output Enable" mask="0x00000040" name="P6"/>
          <bitfield caption="Output Enable" mask="0x00000080" name="P7"/>
          <bitfield caption="Output Enable" mask="0x00000100" name="P8"/>
          <bitfield caption="Output Enable" mask="0x00000200" name="P9"/>
          <bitfield caption="Output Enable" mask="0x00000400" name="P10"/>
          <bitfield caption="Output Enable" mask="0x00000800" name="P11"/>
          <bitfield caption="Output Enable" mask="0x00001000" name="P12"/>
          <bitfield caption="Output Enable" mask="0x00002000" name="P13"/>
          <bitfield caption="Output Enable" mask="0x00004000" name="P14"/>
          <bitfield caption="Output Enable" mask="0x00008000" name="P15"/>
          <bitfield caption="Output Enable" mask="0x00010000" name="P16"/>
          <bitfield caption="Output Enable" mask="0x00020000" name="P17"/>
          <bitfield caption="Output Enable" mask="0x00040000" name="P18"/>
          <bitfield caption="Output Enable" mask="0x00080000" name="P19"/>
          <bitfield caption="Output Enable" mask="0x00100000" name="P20"/>
          <bitfield caption="Output Enable" mask="0x00200000" name="P21"/>
          <bitfield caption="Output Enable" mask="0x00400000" name="P22"/>
          <bitfield caption="Output Enable" mask="0x00800000" name="P23"/>
          <bitfield caption="Output Enable" mask="0x01000000" name="P24"/>
          <bitfield caption="Output Enable" mask="0x02000000" name="P25"/>
          <bitfield caption="Output Enable" mask="0x04000000" name="P26"/>
          <bitfield caption="Output Enable" mask="0x08000000" name="P27"/>
          <bitfield caption="Output Enable" mask="0x10000000" name="P28"/>
          <bitfield caption="Output Enable" mask="0x20000000" name="P29"/>
          <bitfield caption="Output Enable" mask="0x40000000" name="P30"/>
          <bitfield caption="Output Enable" mask="0x80000000" name="P31"/>
        </register>
